In [3]:
import pandas as pd
from datetime import timedelta

In [4]:
df = pd.read_csv('../data/smhi_temp_data_save.csv', usecols=[0, 1, 2, 3], header=6, sep=';')

In [5]:
df

             Datum Tid (UTC)  Lufttemperatur Kvalitet
0       1944-01-01  07:00:00             1.6        G
1       1944-01-01  13:00:00             3.8        G
2       1944-01-01  18:00:00             4.2        G
3       1944-01-02  07:00:00             0.6        G
4       1944-01-02  13:00:00             3.8        G
...            ...       ...             ...      ...
435387  2006-12-05  09:00:00             9.4        G
435388  2006-12-05  10:00:00            10.1        Y
435389  2006-12-05  11:00:00            10.8        Y
435390  2006-12-05  12:00:00            10.9        G
435391  2006-12-05  13:00:00            10.8        Y

[435392 rows x 4 columns]

In [6]:
df['Snittemperatur'] = df.groupby('Datum')['Lufttemperatur'].transform('mean').round(2)

In [7]:
df = df.groupby('Datum').max().drop('Lufttemperatur', axis=1).reset_index()

In [8]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur
0      1944-01-01  18:00:00        G            3.20
1      1944-01-02  18:00:00        G            3.60
2      1944-01-03  18:00:00        G            2.80
3      1944-01-04  18:00:00        G           -4.47
4      1944-01-05  18:00:00        G           -1.40
...           ...       ...      ...             ...
22980  2006-12-01  23:00:00        Y            8.03
22981  2006-12-02  23:00:00        Y            8.81
22982  2006-12-03  23:00:00        Y            8.11
22983  2006-12-04  23:00:00        Y            8.57
22984  2006-12-05  13:00:00        Y            9.22

[22985 rows x 4 columns]

In [9]:
num_rows = df.count(axis=0)[0]

C:\Users\olofs\AppData\Local\Temp\ipykernel_20272\83482794.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  num_rows = df.count(axis=0)[0]

In [10]:
num_rows

22985

In [11]:
df.dtypes

Datum              object
Tid (UTC)          object
Kvalitet           object
Snittemperatur    float64
dtype: object

In [12]:
df['Year'] = df['Datum'].str.split('-').str[0]

In [13]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur  Year
0      1944-01-01  18:00:00        G            3.20  1944
1      1944-01-02  18:00:00        G            3.60  1944
2      1944-01-03  18:00:00        G            2.80  1944
3      1944-01-04  18:00:00        G           -4.47  1944
4      1944-01-05  18:00:00        G           -1.40  1944
...           ...       ...      ...             ...   ...
22980  2006-12-01  23:00:00        Y            8.03  2006
22981  2006-12-02  23:00:00        Y            8.81  2006
22982  2006-12-03  23:00:00        Y            8.11  2006
22983  2006-12-04  23:00:00        Y            8.57  2006
22984  2006-12-05  13:00:00        Y            9.22  2006

[22985 rows x 5 columns]

In [14]:
df['Year'].value_counts().sort_values(ascending=False)

Year
1944    366
1972    366
2000    366
1968    366
2004    366
       ...
2005    365
1981    365
1975    365
1979    365
2006    339
Name: count, Length: 63, dtype: int64

In [15]:
years = []
for ind, row in df.iterrows():
    year = row['Year']
    if year not in years:
        years.append(year)
    else:
        pass

In [16]:
years

['1944',
 '1945',
 '1946',
 '1947',
 '1948',
 '1949',
 '1950',
 '1951',
 '1952',
 '1953',
 '1954',
 '1955',
 '1956',
 '1957',
 '1958',
 '1959',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006']

In [17]:
df['Year'] = pd.to_datetime(df['Year'], yearfirst=True, format='%Y')

In [18]:
df.dtypes

Datum                     object
Tid (UTC)                 object
Kvalitet                  object
Snittemperatur           float64
Year              datetime64[ns]
dtype: object

In [19]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur       Year
0      1944-01-01  18:00:00        G            3.20 1944-01-01
1      1944-01-02  18:00:00        G            3.60 1944-01-01
2      1944-01-03  18:00:00        G            2.80 1944-01-01
3      1944-01-04  18:00:00        G           -4.47 1944-01-01
4      1944-01-05  18:00:00        G           -1.40 1944-01-01
...           ...       ...      ...             ...        ...
22980  2006-12-01  23:00:00        Y            8.03 2006-01-01
22981  2006-12-02  23:00:00        Y            8.81 2006-01-01
22982  2006-12-03  23:00:00        Y            8.11 2006-01-01
22983  2006-12-04  23:00:00        Y            8.57 2006-01-01
22984  2006-12-05  13:00:00        Y            9.22 2006-01-01

[22985 rows x 5 columns]

In [20]:
df['Datum'] = pd.to_datetime(df['Datum'], yearfirst=True, format='ISO8601')

In [21]:
df.to_csv('../data/Olof_Save_avg_daily_temp_data.csv', index=False, mode='w')

Time for percipitation

In [22]:
df_percipitation = pd.read_csv('../data/smhi_perc_data_save.csv',  usecols=[0, 1, 2, 3], header=6, sep=';')

In [23]:
df_percipitation

,Från Datum Tid (UTC),Till Datum Tid (UTC),Representativt dygn,Nederbördsmängd
0,1944-01-01 07:00:01,1944-01-02 07:00:00,1944-01-01,0.2
1,1944-01-02 07:00:01,1944-01-03 07:00:00,1944-01-02,0.4
2,1944-01-03 07:00:01,1944-01-04 07:00:00,1944-01-03,0.0
3,1944-01-04 07:00:01,1944-01-05 07:00:00,1944-01-04,0.0
4,1944-01-05 07:00:01,1944-01-06 07:00:00,1944-01-05,2.1
...,...,...,...,...
21514,2002-11-26 06:00:01,2002-11-27 06:00:00,2002-11-26,4.1
21515,2002-11-27 06:00:01,2002-11-28 06:00:00,2002-11-27,0.0
21516,2002-11-28 06:00:01,2002-11-29 06:00:00,2002-11-28,3.9
21517,2002-11-29 06:00:01,2002-11-30 06:00:00,2002-11-29,7.1
21518,2002-11-30 06:00:01,2002-12-01 06:00:00,2002-11-30,5.0

In [24]:
df_percipitation.sort_values(by=['Representativt dygn'])

,Från Datum Tid (UTC),Till Datum Tid (UTC),Representativt dygn,Nederbördsmängd
0,1944-01-01 07:00:01,1944-01-02 07:00:00,1944-01-01,0.2
1,1944-01-02 07:00:01,1944-01-03 07:00:00,1944-01-02,0.4
2,1944-01-03 07:00:01,1944-01-04 07:00:00,1944-01-03,0.0
3,1944-01-04 07:00:01,1944-01-05 07:00:00,1944-01-04,0.0
4,1944-01-05 07:00:01,1944-01-06 07:00:00,1944-01-05,2.1
...,...,...,...,...
21514,2002-11-26 06:00:01,2002-11-27 06:00:00,2002-11-26,4.1
21515,2002-11-27 06:00:01,2002-11-28 06:00:00,2002-11-27,0.0
21516,2002-11-28 06:00:01,2002-11-29 06:00:00,2002-11-28,3.9
21517,2002-11-29 06:00:01,2002-11-30 06:00:00,2002-11-29,7.1
21518,2002-11-30 06:00:01,2002-12-01 06:00:00,2002-11-30,5.0

In [25]:
df_percipitation = df_percipitation.drop(['Från Datum Tid (UTC)', 'Till Datum Tid (UTC)'], axis=1)

In [26]:
df_percipitation

      Representativt dygn  Nederbördsmängd
0              1944-01-01              0.2
1              1944-01-02              0.4
2              1944-01-03              0.0
3              1944-01-04              0.0
4              1944-01-05              2.1
...                   ...              ...
21514          2002-11-26              4.1
21515          2002-11-27              0.0
21516          2002-11-28              3.9
21517          2002-11-29              7.1
21518          2002-11-30              5.0

[21519 rows x 2 columns]

In [27]:
num_rows_percipitaion = df_percipitation.count(axis=0)[0]

C:\Users\olofs\AppData\Local\Temp\ipykernel_20272\3562049814.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  num_rows_percipitaion = df_percipitation.count(axis=0)[0]

In [28]:
num_rows_percipitaion

21519

In [29]:
df_percipitation.dtypes

Representativt dygn     object
Nederbördsmängd        float64
dtype: object

In [30]:
df_percipitation['Year'] = df_percipitation['Representativt dygn'].str.split('-').str[0]

In [31]:
df_percipitation

      Representativt dygn  Nederbördsmängd  Year
0              1944-01-01              0.2  1944
1              1944-01-02              0.4  1944
2              1944-01-03              0.0  1944
3              1944-01-04              0.0  1944
4              1944-01-05              2.1  1944
...                   ...              ...   ...
21514          2002-11-26              4.1  2002
21515          2002-11-27              0.0  2002
21516          2002-11-28              3.9  2002
21517          2002-11-29              7.1  2002
21518          2002-11-30              5.0  2002

[21519 rows x 3 columns]

In [32]:
df_percipitation['Representativt dygn'] = pd.to_datetime(df_percipitation['Representativt dygn'])
df_percipitation['Year'] = pd.to_datetime(df_percipitation['Year'], format='%Y')

In [33]:
df_percipitation

      Representativt dygn  Nederbördsmängd       Year
0              1944-01-01              0.2 1944-01-01
1              1944-01-02              0.4 1944-01-01
2              1944-01-03              0.0 1944-01-01
3              1944-01-04              0.0 1944-01-01
4              1944-01-05              2.1 1944-01-01
...                   ...              ...        ...
21514          2002-11-26              4.1 2002-01-01
21515          2002-11-27              0.0 2002-01-01
21516          2002-11-28              3.9 2002-01-01
21517          2002-11-29              7.1 2002-01-01
21518          2002-11-30              5.0 2002-01-01

[21519 rows x 3 columns]

In [34]:
years_in_df_percipitation = df_percipitation['Year'].nunique()

In [35]:
years_in_df_percipitation

59

In [36]:
2002-1944

58

In [37]:
days_in_df_percipitation = df_percipitation['Representativt dygn'].nunique()

In [38]:
# same number ofr days as rows in the dataset. ie. no duplicate days
days_in_df_percipitation - num_rows_percipitaion

0

In [39]:
df_percipitation.to_csv('../data/olof_Save_daily_percipitation.csv', index=False, mode='w')

Time for the wind

In [46]:
df_wind = pd.read_csv('../data/smhi_wind_data_Save.csv', usecols=[0, 1, 2, 3, 4, 5], sep=';', header=7)

In [47]:
df_wind.dtypes

Datum             object
Tid (UTC)         object
Vindriktning     float64
Kvalitet          object
Vindhastighet    float64
Kvalitet.1        object
dtype: object